app/controllers/sermon_authors_controller.rb

SELECT "sermon_authors".* FROM "sermon_authors"
---
  def index
    @sermon_authors = SermonAuthor.all

INSERT INTO "sermon_authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mike"], ["created_at", "2017-12-28 16:43:08.289556"], ["updated_at", "2017-12-28 16:43:08.289556"]]
---
  def create
    @sermon_author = SermonAuthor.new(sermon_author_params)
    @sermon_author.save

SELECT  "sermon_authors".* FROM "sermon_authors" WHERE "sermon_authors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @sermon_author = SermonAuthor.find(params[:id])