app/controllers/sermons_controller.rb

  def create
    @sermon = Sermon.new(create_sermon_params)
    @sermon.save
---
INSERT INTO "sermons" ("sermon_author_id", "title", "passage", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sermon_author_id", 1], ["title", "adsf"], ["passage", "asfd"], ["created_at", "2018-01-20 21:51:50.238254"], ["updated_at", "2018-01-20 21:51:50.238254"]]

  def show
    @sermon = Sermon.find(params[:id])
---
SELECT  "sermons".* FROM "sermons" WHERE "sermons"."id" = $1 LIMIT 1  [["id", 1]]