app/controllers/sermon_series_controller.rb

SELECT  "sermon_series".* FROM "sermon_series" WHERE "sermon_series"."id" = $1 LIMIT 1  [["id", 12]]
---
  def show
    @sermon_series = SermonSeries.find(params[:id])