app/views/sermon_authors/show.html.erb

SELECT "sermons".* FROM "sermons" WHERE "sermons"."sermon_author_id" = $1  [["sermon_author_id", 2]]
---
<p>Sermons Series</p>
<% @sermon_author.sermon_series.each do |sermon_series|%>